---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplaySketchyLines
source: html/c92b463b-1b59-695d-f06b-a76dacfaf2f0.htm
---
# Autodesk.Revit.DB.ViewDisplaySketchyLines

Represents the settings for sketchy lines.

## Syntax (C#)
```csharp
public class ViewDisplaySketchyLines : IDisposable
```